FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_I2C.c
T_uezError ILPC2478_I2C_ResetBus(void *aWorkspace)
{
    T_uezError error = UEZ_ERROR_NONE;
    //T_LPC2478_I2C_Workspace *p = (T_LPC2478_I2C_Workspace *)aWorkspace;
    //TODO: implement reset functionality.

    return error;
}

IRQ_ROUTINE(ILPC2478_I2C0InterruptHandler)
{
    IRQ_START();
    ILPC2478_ProcessState(G_lpc2478_i2c0Workspace);
    IRQ_END();
}

IRQ_ROUTINE(ILPC2478_I2C1InterruptHandler)
{
    IRQ_START();
    ILPC2478_ProcessState(G_lpc2478_i2c1Workspace);
    IRQ_END();
}

IRQ_ROUTINE(ILPC2478_I2C2InterruptHandler)
{
    IRQ_START();
    ILPC2478_ProcessState(G_lpc2478_i2c2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_I2C_Bus0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 I2C Bus0 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_I2C_Bus0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_I2C_Workspace *p = (T_LPC2478_I2C_Workspace *)aWorkspace;
    p->iRegs = (T_lpc2478_i2cRegs *)I2C0_BASE;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc2478_i2c0Workspace = p;

    // Setup interrupt vector
    InterruptRegister(
        INTERRUPT_CHANNEL_I2C0,
        ILPC2478_I2C0InterruptHandler,
        INTERRUPT_PRIORITY_NORMAL,
        "I2C0");
    InterruptEnable(INTERRUPT_CHANNEL_I2C0);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_I2C_Bus1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 I2C Bus1 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_I2C_Bus1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_I2C_Workspace *p = (T_LPC2478_I2C_Workspace *)aWorkspace;
    p->iRegs = (T_lpc2478_i2cRegs *)I2C1_BASE;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc2478_i2c1Workspace = p;

    // Setup interrupt vector
    InterruptRegister(
        INTERRUPT_CHANNEL_I2C1,
        ILPC2478_I2C1InterruptHandler,
        INTERRUPT_PRIORITY_NORMAL,
        "I2C1");
    InterruptEnable(INTERRUPT_CHANNEL_I2C1);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_I2C_Bus2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 I2C Bus2 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_I2C_Bus2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_I2C_Workspace *p = (T_LPC2478_I2C_Workspace *)aWorkspace;
    p->iRegs = (T_lpc2478_i2cRegs *)I2C2_BASE;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc2478_i2c2Workspace = p;

    // Setup interrupt vector
    InterruptRegister(
        INTERRUPT_CHANNEL_I2C2,
        ILPC2478_I2C2InterruptHandler,
        INTERRUPT_PRIORITY_NORMAL,
        "I2C2");
    InterruptEnable(INTERRUPT_CHANNEL_I2C2);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_I2C0_Require(
        T_uezGPIOPortPin aPinSDA0,
        T_uezGPIOPortPin aPinSCL0)
{
    T_LPC2478_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();
    // Register I2C0 Bus driver
    HALInterfaceRegister("I2C0", (T_halInterface *)&I2C_LPC2478_Bus0_Interface,
            0, (T_halWorkspace **)&p);
    LPC2478_PINSEL_ConfigPin(aPinSDA0, G_sda0, ARRAY_COUNT(G_sda0));
    LPC2478_PINSEL_ConfigPin(aPinSCL0, G_scl0, ARRAY_COUNT(G_scl0));
    p->iSCLPin = aPinSCL0;
    p->iSDAPin = aPinSDA0;
}

void LPC2478_I2C1_Require(
        T_uezGPIOPortPin aPinSDA1,
        T_uezGPIOPortPin aPinSCL1)
{
    T_LPC2478_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();
    // Register I2C1 Bus driver
    HALInterfaceRegister("I2C1", (T_halInterface *)&I2C_LPC2478_Bus1_Interface,
            0, (T_halWorkspace **)&p);
    LPC2478_PINSEL_ConfigPin(aPinSDA1, G_sda1, ARRAY_COUNT(G_sda1));
    LPC2478_PINSEL_ConfigPin(aPinSCL1, G_scl1, ARRAY_COUNT(G_scl1));
    p->iSCLPin = aPinSCL1;
    p->iSDAPin = aPinSDA1;
}

void LPC2478_I2C2_Require(
        T_uezGPIOPortPin aPinSDA2,
        T_uezGPIOPortPin aPinSCL2)
{
    T_LPC2478_I2C_Workspace *p;

    HAL_DEVICE_REQUIRE_ONCE();
    // Register I2C0 Bus driver
    HALInterfaceRegister("I2C2", (T_halInterface *)&I2C_LPC2478_Bus2_Interface,
            0, (T_halWorkspace **)&p);

    LPC2478_PINSEL_ConfigPin(aPinSDA2, G_sda2, ARRAY_COUNT(G_sda2));
    LPC2478_PINSEL_ConfigPin(aPinSCL2, G_scl2, ARRAY_COUNT(G_scl2));
    p->iSCLPin = aPinSCL2;
    p->iSDAPin = aPinSDA2;
}
/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_I2CBus I2C_LPC2478_Bus0_Interface = {
    "LPC2478 I2C Bus0",
    0x0100,
    LPC2478_I2C_Bus0_InitializeWorkspace,
    sizeof(T_LPC2478_I2C_Workspace),

    ILPC2478_I2C_StartRead,
    ILPC2478_I2C_StartWrite,
    0,0,0,
    ILPC2478_I2C_IsHung, ILPC2478_I2C_ResetBus
};

const HAL_I2CBus I2C_LPC2478_Bus1_Interface = {
    "LPC2478 I2C Bus1",
    0x0100,
    LPC2478_I2C_Bus1_InitializeWorkspace,
    sizeof(T_LPC2478_I2C_Workspace),

    ILPC2478_I2C_StartRead,
    ILPC2478_I2C_StartWrite,
    0,0,0,
    ILPC2478_I2C_IsHung, ILPC2478_I2C_ResetBus
};

const HAL_I2CBus I2C_LPC2478_Bus2_Interface = {
    "LPC2478 I2C Bus2",
    0x0100,
    LPC2478_I2C_Bus2_InitializeWorkspace,
    sizeof(T_LPC2478_I2C_Workspace),

    ILPC2478_I2C_StartRead,
    ILPC2478_I2C_StartWrite,
    0,0,0,
    ILPC2478_I2C_IsHung, ILPC2478_I2C_ResetBus
};

/*-------------------------------------------------------------------------*
 * End of File:  I2C.c
 *-------------------------------------------------------------------------*/
